# Veri Seçme ve İndeksleme
 Veri Seçme ve İndeksleme, pandas kütüphanesini kullanarak veri çerçevelerindeki belirli verilere erişme ve bu verileri işleme sürecini ifade eder.

In [1]:
import pandas as pd

data = {'Name': ['Alice', 'Bob', 'Charlie', 'David'],
        'Age': [25, 30, 22, 28],
        'City': ['New York', 'Los Angeles', 'Chicago', 'Houston']}

df = pd.DataFrame(data)

In [2]:
df

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   22      Chicago
3    David   28      Houston

### Veri Seçme ve İndeksleme işlemleri
##### 1. Sütun Seçme:

In [3]:
df['Age']

0    25
1    30
2    22
3    28
Name: Age, dtype: int64

**2. Birden Fazla Sütun Seçme:**

In [4]:
df[['Name', 'City']]

      Name         City
0    Alice     New York
1      Bob  Los Angeles
2  Charlie      Chicago
3    David      Houston

##### 2. Satır Seçme: 
Satır Numarasına Göre Seçme

In [5]:
df.iloc[1]  # İkinci satırı seçer

Name            Bob
Age              30
City    Los Angeles
Name: 1, dtype: object

Belirli Satırları Dilimleme (Slicing):

In [6]:
df.iloc[1:4]  # 1. satırdan 3. satıra kadar olan satırları seçer

      Name  Age         City
1      Bob   30  Los Angeles
2  Charlie   22      Chicago
3    David   28      Houston

**3.Koşullu İndeksleme:**

In [7]:
df[df['Age'] >= 25]  # Yaşı 25 ve üstü olanları seçer

    Name  Age         City
0  Alice   25     New York
1    Bob   30  Los Angeles
3  David   28      Houston

**4.Etiket (Label) İndeksleme:**
- Özel İndeks Belirleme: 
Bir sütunu indeks olarak belirlemek için set_index metodunu kullanabilirsiniz.

In [8]:
df.set_index('Name')

         Age         City
Name
Alice     25     New York
Bob       30  Los Angeles
Charlie   22      Chicago
David     28      Houston

**5.Yeniden İndeksleme:**
- Varolan bir indeksi değiştirerek DataFrame'inizi yeniden düzenleyebilirsiniz.

In [9]:
new_index = ['A', 'B', 'C', 'D'] 
df.index =new_index
df

      Name  Age         City
A    Alice   25     New York
B      Bob   30  Los Angeles
C  Charlie   22      Chicago
D    David   28      Houston

**6. Çok Koşullu İndexleme**

In [10]:
import pandas as pd

# Örnek veri çerçevesi oluşturalım
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
    'Age': [25, 30, 22, 28, 24],
    'Salary': [50000, 60000, 45000, 70000, 55000]
}

df = pd.DataFrame(data)

# Çoklu koşullu indeksleme yapalım
# Yaşı 25'ten küçük VE maaşı 55000'den büyük olan veya adı 'Alice' olan kayıtları seçelim
condition1 = df['Age'] < 25
condition2 = df['Salary'] > 55000
condition3 = df['Name'] == 'Alice'

filtered_df = df[(condition1 & condition2) | condition3] # & = ve, | = veya anlamında

print(filtered_df)

    Name  Age  Salary
0  Alice   25   50000

**7. Belirli Değere Göre Seçim Yapma**

In [11]:
# 'Name' sütununda 'Alice' olan kayıtları seçelim
df[df['Name'] == 'Alice']

    Name  Age  Salary
0  Alice   25   50000

**8.Koşullu Sütun Seçimi**

In [12]:
# Yaşı 25'ten büyük olan sütunları seçelim 
df[df["Age"] > 25]["Salary"]

1    60000
3    70000
Name: Salary, dtype: int64

**9.Değer Değiştirme:**

In [13]:
df.loc[2, "Name"] = "Kesha" # charlie, kesha olarak değişti
df

    Name  Age  Salary
0  Alice   25   50000
1    Bob   30   60000
2  Kesha   22   45000
3  David   28   70000
4    Eva   24   55000

**10.Satır Ekleme ve Silme:**

In [14]:
df.loc[len(df)] = "Charlie", "31", "65000"
df

      Name Age Salary
0    Alice  25  50000
1      Bob  30  60000
2    Kesha  22  45000
3    David  28  70000
4      Eva  24  55000
5  Charlie  31  65000

In [15]:
# Yeni bir satır eklemek için veri oluşturalım
new_row = {'Name': 'David', 'Age': 28}

# .loc[] ile yeni satırı DataFrame'e ekleyelim
df.loc[len(df)] = new_row

In [16]:
df

      Name Age Salary
0    Alice  25  50000
1      Bob  30  60000
2    Kesha  22  45000
3    David  28  70000
4      Eva  24  55000
5  Charlie  31  65000
6    David  28    NaN

In [22]:
df

      Name Age Salary
0    Alice  25  50000
1      Bob  30  60000
2    Kesha  22  45000
3    David  28  70000
4      Eva  24  55000
5  Charlie  31  65000
6    David  28    NaN

**11.Satır Silme**

In [26]:
df.drop(2, axis=0, inplace = True)

In [27]:
df

      Name Age Salary
0    Alice  25  50000
1      Bob  30  60000
3    David  28  70000
4      Eva  24  55000
5  Charlie  31  65000
6    David  28    NaN